In [ ]:
# pandas are already installed in pandas along with anaconda
# !pip install pandas

In [1]:
try:
    file=open('data.csv','x')
    file.close()
except:
    print("The file is already there!!!!!")

The file is already there!!!!!

In [2]:
import pandas as pd
df=pd.read_csv('data.csv')
df

   SN   Name  Age     Add  Phone
0   1    Ram   25     bkt   9865
1   2  Shyam   34     ktm   9866
2   3   Hari   23     prk   9867
3   4  Sabin   33   brhwa   9868
4   5  Nabin    4  butwal   9868
5   6   Sita   43  banepa   9870

In [1]:
cc

NameError: name 'cc' is not defined

In [4]:
import pandas as pd
df=pd.read_csv('data.csv',index_col='SN')
df.head(2)    #empty shows 5 rows

     Name  Age  Add  Phone
SN
1     Ram   25  bkt   9865
2   Shyam   34  ktm   9866

In [5]:
import pandas as pd
df=pd.read_csv('data.csv',index_col='SN')
df.tail(2)

     Name  Age     Add  Phone
SN
5   Nabin    4  butwal   9868
6    Sita   43  banepa   9870

In [7]:
import pandas as pd
df=pd.read_csv('data.csv',index_col='SN')
df.iloc[1:3]

     Name  Age  Add  Phone
SN
2   Shyam   34  ktm   9866
3    Hari   23  prk   9867

In [8]:
import pandas as pd
df=pd.read_csv('data.csv',index_col='SN')
df.iloc[1:3,0:2]   #iloc[row(index),column]

     Name  Age
SN
2   Shyam   34
3    Hari   23

In [9]:
import pandas as pd
df=pd.read_csv('data.csv',index_col='SN',usecols=['SN','Name','Phone'])
df

     Name  Phone
SN
1     Ram   9865
2   Shyam   9866
3    Hari   9867
4   Sabin   9868
5   Nabin   9868
6    Sita   9870

In [10]:
import pandas as pd
df=pd.read_csv('data.csv',index_col='SN')
df.loc[2:5]

     Name  Age     Add  Phone
SN
2   Shyam   34     ktm   9866
3    Hari   23     prk   9867
4   Sabin   33   brhwa   9868
5   Nabin    4  butwal   9868

In [12]:
import pandas as pd
df=pd.read_csv('data.csv',index_col='Name')
df.loc['Shyam':'Sabin']

       SN  Age    Add  Phone
Name
Shyam   2   34    ktm   9866
Hari    3   23    prk   9867
Sabin   4   33  brhwa   9868

In [15]:
import pandas as pd
df=pd.read_csv('data.csv',index_col='SN')
df['Add']

SN
1       bkt
2       ktm
3       prk
4     brhwa
5    butwal
6    banepa
Name: Add, dtype: object

In [16]:
import pandas as pd
df=pd.read_csv('data.csv',index_col='SN')
df['Add']=='ktm'

SN
1    False
2     True
3    False
4    False
5    False
6    False
Name: Add, dtype: bool

In [17]:
import pandas as pd
df=pd.read_csv('data.csv',index_col='SN')
df[df['Add']=='ktm']

     Name  Age  Add  Phone
SN
2   Shyam   34  ktm   9866

In [19]:
import pandas as pd
df=pd.read_csv('data.csv',index_col='SN')
df['Age']>30

SN
1    False
2     True
3    False
4     True
5    False
6     True
Name: Age, dtype: bool

In [20]:
import pandas as pd
df=pd.read_csv('data.csv',index_col='SN')
df[df['Age']>30]

     Name  Age     Add  Phone
SN
2   Shyam   34     ktm   9866
4   Sabin   33   brhwa   9868
6    Sita   43  banepa   9870

In [21]:
import pandas as pd
df=pd.read_csv('data.csv',index_col='SN')
data=df[df['Age']>30]
data.to_csv('new_data.csv')
data

     Name  Age     Add  Phone
SN
2   Shyam   34     ktm   9866
4   Sabin   33   brhwa   9868
6    Sita   43  banepa   9870

In [22]:

df=pd.read_csv('new_data.csv')
df

   SN   Name  Age     Add  Phone
0   2  Shyam   34     ktm   9866
1   4  Sabin   33   brhwa   9868
2   6   Sita   43  banepa   9870

In [24]:
import pandas as pd
df=pd.read_csv('data.csv',index_col='SN')
data=df[(df['Age']>30) & (df['Add']=='ktm')]
# data.to_csv('new_data.csv')
data

     Name  Age  Add  Phone
SN
2   Shyam   34  ktm   9866

In [28]:
data= {'name':['Ram','Shyam','Hari'],
      'age':[45,67,89],
      'add':['Ktm','Bkt','Lalitpur']}
df=pd.DataFrame(data)
print(df)
df.to_csv('New_datas.csv')

    name  age       add
0    Ram   45       Ktm
1  Shyam   67       Bkt
2   Hari   89  Lalitpur

In [32]:
#data structures should be symmetric.... it can be and empty list but not void
# sequence of keys, values should be same


import pandas as pd
df1=pd.DataFrame({'name':['Ram','Shyam','Hari'],
      'age':[45,67,89],
      'add':['Ktm','Bkt','Lalitpur']})
df2=pd.DataFrame({'name':['Ravan','Kangsa','Hari talika'],
      'age':[32,34,54],
      'add':['Ktm','Bkt','Lalitpur']})

df3=pd.DataFrame({'name':['Chame','Tame','Kame'],
      'age':[43,54,23],
      'add':['Ktm','Bkt','Lalitpur']})
df=pd.concat([df1,df2,df3])
df

          name  age       add
0          Ram   45       Ktm
1        Shyam   67       Bkt
2         Hari   89  Lalitpur
0        Ravan   32       Ktm
1       Kangsa   34       Bkt
2  Hari talika   54  Lalitpur
0        Chame   43       Ktm
1         Tame   54       Bkt
2         Kame   23  Lalitpur

In [34]:
data= {'name':['Ram','Shyam','Hari'],
      'age':[45,67,89],
      'add':['Ktm','Bkt','Lalitpur']}
df=pd.DataFrame(data)
df.to_json('new_datas.json')
df

    name  age       add
0    Ram   45       Ktm
1  Shyam   67       Bkt
2   Hari   89  Lalitpur

In [35]:
!pip install xlrd

Defaulting to user installation because normal site-packages is not writeable
Requirement already satisfied: xlrd in c:\programdata\anaconda3\lib\site-packages (2.0.1)

In [ ]:
# !pip install xlrd

import pandas as pd
df=pd.read_excel('')
df

In [ ]:
# panda cheatsheet